# Copyright 2023 ETH Zurich and University of Bologna.
# Solderpad Hardware License, Version 0.51, see LICENSE for details.
# SPDX-License-Identifier: SHL-0.51
#
# Authors:
#  - Thomas Benz <tbenz@iis.ee.ethz.ch>

# Automatically generated by gen_netlist.py
# 15 path groups

set_input_delay 0.0 [all_inputs]
set_output_delay 0.0 [all_outputs]
set_input_transition 0.1 [all_inputs]
set_load 0.02 [all_outputs]

set_min_delay -from clk_i -through i_mx_l3m0o0/A0 -to clk_o[0] 0.200000
set_max_delay -from clk_i -through i_mx_l3m0o0/A0 -to clk_o[0] 0.400000

set_min_delay -from clk_i -through i_mx_l3m0o0/A1 -to clk_o[0] 0.575000
set_max_delay -from clk_i -through i_mx_l3m0o0/A1 -to clk_o[0] 0.775000

set_min_delay -from clk_i -through i_mx_l3m1o0/A0 -to clk_o[0] 0.950000
set_max_delay -from clk_i -through i_mx_l3m1o0/A0 -to clk_o[0] 1.150000

set_min_delay -from clk_i -through i_mx_l3m1o0/A1 -to clk_o[0] 1.325000
set_max_delay -from clk_i -through i_mx_l3m1o0/A1 -to clk_o[0] 1.525000

set_min_delay -from clk_i -through i_mx_l3m2o0/A0 -to clk_o[0] 1.700000
set_max_delay -from clk_i -through i_mx_l3m2o0/A0 -to clk_o[0] 1.900000

set_min_delay -from clk_i -through i_mx_l3m2o0/A1 -to clk_o[0] 2.075000
set_max_delay -from clk_i -through i_mx_l3m2o0/A1 -to clk_o[0] 2.275000

set_min_delay -from clk_i -through i_mx_l3m3o0/A0 -to clk_o[0] 2.450000
set_max_delay -from clk_i -through i_mx_l3m3o0/A0 -to clk_o[0] 2.650000

set_min_delay -from clk_i -through i_mx_l3m3o0/A1 -to clk_o[0] 2.825000
set_max_delay -from clk_i -through i_mx_l3m3o0/A1 -to clk_o[0] 3.025000

set_min_delay -from clk_i -through i_mx_l3m4o0/A0 -to clk_o[0] 3.200000
set_max_delay -from clk_i -through i_mx_l3m4o0/A0 -to clk_o[0] 3.400000

set_min_delay -from clk_i -through i_mx_l3m4o0/A1 -to clk_o[0] 3.575000
set_max_delay -from clk_i -through i_mx_l3m4o0/A1 -to clk_o[0] 3.775000

set_min_delay -from clk_i -through i_mx_l3m5o0/A0 -to clk_o[0] 3.950000
set_max_delay -from clk_i -through i_mx_l3m5o0/A0 -to clk_o[0] 4.150000

set_min_delay -from clk_i -through i_mx_l3m5o0/A1 -to clk_o[0] 4.325000
set_max_delay -from clk_i -through i_mx_l3m5o0/A1 -to clk_o[0] 4.525000

set_min_delay -from clk_i -through i_mx_l3m6o0/A0 -to clk_o[0] 4.700000
set_max_delay -from clk_i -through i_mx_l3m6o0/A0 -to clk_o[0] 4.900000

set_min_delay -from clk_i -through i_mx_l3m6o0/A1 -to clk_o[0] 5.075000
set_max_delay -from clk_i -through i_mx_l3m6o0/A1 -to clk_o[0] 5.275000

set_min_delay -from clk_i -through i_mx_l3m7o0/A0 -to clk_o[0] 5.450000
set_max_delay -from clk_i -through i_mx_l3m7o0/A0 -to clk_o[0] 5.650000

set_min_delay -from clk_i -through i_mx_l3m7o0/A1 -to clk_o[0] 5.825000
set_max_delay -from clk_i -through i_mx_l3m7o0/A1 -to clk_o[0] 6.025000

group_path -name dly_000_00000 -from clk_i -through i_mx_l3m0o0/A0 -to clk_o[0]
group_path -name dly_000_00001 -from clk_i -through i_mx_l3m0o0/A1 -to clk_o[0]
group_path -name dly_000_00002 -from clk_i -through i_mx_l3m1o0/A0 -to clk_o[0]
group_path -name dly_000_00003 -from clk_i -through i_mx_l3m1o0/A1 -to clk_o[0]
group_path -name dly_000_00004 -from clk_i -through i_mx_l3m2o0/A0 -to clk_o[0]
group_path -name dly_000_00005 -from clk_i -through i_mx_l3m2o0/A1 -to clk_o[0]
group_path -name dly_000_00006 -from clk_i -through i_mx_l3m3o0/A0 -to clk_o[0]
group_path -name dly_000_00007 -from clk_i -through i_mx_l3m3o0/A1 -to clk_o[0]
group_path -name dly_000_00008 -from clk_i -through i_mx_l3m4o0/A0 -to clk_o[0]
group_path -name dly_000_00009 -from clk_i -through i_mx_l3m4o0/A1 -to clk_o[0]
group_path -name dly_000_00010 -from clk_i -through i_mx_l3m5o0/A0 -to clk_o[0]
group_path -name dly_000_00011 -from clk_i -through i_mx_l3m5o0/A1 -to clk_o[0]
group_path -name dly_000_00012 -from clk_i -through i_mx_l3m6o0/A0 -to clk_o[0]
group_path -name dly_000_00013 -from clk_i -through i_mx_l3m6o0/A1 -to clk_o[0]
group_path -name dly_000_00014 -from clk_i -through i_mx_l3m7o0/A0 -to clk_o[0]
group_path -name dly_000_00015 -from clk_i -through i_mx_l3m7o0/A1 -to clk_o[0]
